## The more data one see the better data scientist one will become

In [10]:
import pandas as pd

In [58]:
Task = {
    'Reading_Book' : 2,
    'New_DataSet' : 4,
    'Working_Hours' : 9,
    'MLOPS' : 2
    
    
}

In [59]:
df_t = pd.DataFrame()

In [60]:
df_t['Task'] = Task.keys()

In [61]:
df_t['hrs'] = Task.values()

In [62]:
df_t

            Task  hrs
0   Reading_Book    2
1    New_DataSet    4
2  Working_Hours    9
3          MLOPS    2

In [112]:

# function for set text color of positive
# values in Dataframes
def color_positive_green(v):
    """
    Takes a scalar and returns a string with
    the css property `'color: green'` for positive
    strings, black otherwise.
    """
    if isinstance(v, int):
        if v >= 9 and v <= 18: 
            color = 'blue'
        elif v > 18 or v <= 2:
            color = 'green'
        elif v < 9 or v > 2:
            color = 'red'
        else:
            color = 'black'
        return 'color: %s' % color
 
# df.style.applymap(color_positive_green)

In [113]:
print("Total Hours : 24")
used_hours = df_t['hrs'].sum()
print(f"Remaining Hours : {24 - used_hours}")

Total Hours : 24
Remaining Hours : 7

In [114]:
df_test = pd.DataFrame(columns=['col1','col2'])
cnt = 0 
for i,v in enumerate(list(range(1,25))):
    cnt += 1
    if v >= 9 and v <= 18: 
        df_test.loc[len(df_test.index)] = [df_t["hrs"][2], df_t["Task"][2]] 
#         print(f'{v} : {df_t["hrs"][2]} {df_t["Task"][2]}')
    elif v > 18 or v <= 2:
#         print(f'{v} : {df_t["hrs"][1]} {df_t["Task"][1]}')
        df_test.loc[len(df_test.index)] = [df_t["hrs"][1], df_t["Task"][1]]
    elif v < 9 or v > 2:
#         print(f'{v} : {df_t["hrs"][0]} {df_t["Task"][0]}')    
        df_test.loc[len(df_test.index)] = [df_t["hrs"][0], df_t["Task"][0]]
df_test.style.applymap(color_positive_green)

In [105]:
from numpy.random import randint
list(randint(10, size=2))

[1, 5]

In [106]:
df_t

            Task  hrs
0   Reading_Book    2
1    New_DataSet    4
2  Working_Hours    9
3          MLOPS    2

In [86]:
df_t.loc[len(df_t.index)] = ['Amy', 89]

In [90]:
df_t.drop(4,  inplace = True)